// the-date-type

'use strict';

(function () {
  // ----------------------------------------------------------------------------------------------------
  // `Date.UTC()` 方法, 将'年/月/日/时/分/秒/毫秒'转换为毫秒数,
  //   1. 年/月必填, 其他可选,
  //   2. 月份从 0 开始,
  //   3. 时区为 0 时区

  var ms01 = Date.UTC(2012, 3);
  var ms02 = Date.parse('2012-04-01T00:00:00.000Z');
  console.assert(ms01 === ms02);
})();

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 如果转换失败, 结果为 `Number.NaN`

  console.assert(Number.isNaN(Date.UTC()));
})();

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 构造函数 `new Date()` 会自动调用 `Date.UTC()` 进行转换,
  // 需要注意的是, 此时会使用当前系统的时区

  var msUTC = Date.UTC(2012, 3);
  var msBEIJING = new Date(2012, 3).getTime();

  console.assert(msBEIJING + 8 * 60 * 60 * 1000 === msUTC);
})();
