// the-date-type

'use strict';

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 无参数时, 返回当前时间

  var date = new Date();
})();

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 有参数时, 有三种格式的参数:
  //   1. 毫秒数
  //   2. 字符串 (底层调用 Date.parse() 方法)
  //   3. 年/月[/日/时/分/秒/毫秒] (底层调用 Date.UTC() 方法)

  var date = new Date(9);
  console.assert(date.toISOString() === '1970-01-01T00:00:00.009Z');
})();
