// the-date-type

'use strict';

(function () {
  // ----------------------------------------------------------------------------------------------------
  // `Date.parse()` 方法, 将字符串转换为毫秒数

  var ms01 = Date.parse('4/12/2012');
  var ms02 = Date.parse('April 12, 2012');
  var ms03 = Date.parse('2012-04-12T00:00:00.000');

  console.assert(ms01 === ms02);
  console.assert(ms01 === ms03);
})();

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 未指定时区时, 默认使用当前系统时区

  var ms01 = Date.parse('2012-04-12T00:00:00.000');
  var ms02 = Date.parse('2012-04-12T00:00:00.000+0800');
  console.assert(ms01 === ms02);

  var ms03 = Date.parse('2012-04-12T00:00:00.000Z');
  var ms04 = Date.parse('2012-04-12T00:00:00.000+0000');
  console.assert(ms03 === ms04);
})();

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 如果转换失败, 结果为 `Number.NaN`

  console.assert(Number.isNaN(Date.parse('')));
})();

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 对于构造函数 `new Date()`, 如果参数是一个字符串, 则它会自动调用 `Date.parse()` 方法转换

  console.assert(new Date('2012-04-12T00:00:00.000').getTime() === Date.parse('2012-04-12T00:00:00.000'));
  console.assert(new Date('2012-04-12T00:00:00.000Z').getTime() === Date.parse('2012-04-12T00:00:00.000+0000'));
})();
