// location-methods

'use strict';

(function () {
  // ----------------------------------------------------------------------------------------------------
  // `Array.prototype.indexOf()` 方法,
  // 使用 === 匹配元素, 如果匹配则返回索引, 否则返回 -1

  var arr = [1, 2, 3, 4, 5, 4, 3, 2, 1];
  console.assert(arr.indexOf(3) === 2);
})();

(function () {
  // ----------------------------------------------------------------------------------------------------
  // 可以指定开始查找的索引

  var arr = [1, 2, 3, 4, 5, 4, 3, 2, 1];
  console.assert(arr.indexOf(3) === 2);
  console.assert(arr.indexOf(3, 3) === 6);
})();
